Replacing diagrams with PlantUML
